src/DataProcessors/ИнтеграцияУправлениеПерсоналом/ИнтеграцияУправлениеПерсоналом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИнтеграцияУправлениеПерсоналом</name>
</mdclass:DataProcessor>

src/Catalogs/ШтатноеРасписание/ШтатноеРасписание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтатноеРасписание</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрядКатегория</name>
    <type>
      <types>CatalogRef.РазрядыКатегорииДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыСотрудников</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
      <types>CatalogRef.РежимыРаботыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Утверждена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкладТариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкладТарифМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкладТарифМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФОТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФОТМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФОТМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициентРазмер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициентРазмерМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициентРазмерМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СевернаяНадбавкаРазмер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СевернаяНадбавкаРазмерМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СевернаяНадбавкаРазмерМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПриема</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияЗарплатыВБухучете</name>
    <comment>АПК:58 Способ отражения описывает счет и субконто</comment>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВБухУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтношениеКЕНВД</name>
    <type>
      <types>EnumRef.ОтношениеКЕНВДЗатратНаЗарплату</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяФинансирования</name>
    <type>
      <types>CatalogRef.СтатьиФинансированияЗарплата</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифнаяСетка</name>
    <type>
      <types>CatalogRef.ТарифныеСетки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифнаяСеткаНадбавки</name>
    <type>
      <types>CatalogRef.ТарифныеСетки</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрядКатегорияНадбавки</name>
    <type>
      <types>CatalogRef.РазрядыКатегорииДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>НадбавкаЗаВредностьРазмер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НадбавкаЗаВредностьРазмерМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НадбавкаЗаВредностьРазмерМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией</name>
    <type>
      <types>EnumRef.ВидыРаботСДосрочнойПенсией</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеДосрочногоНазначенияПенсии</name>
    <type>
      <types>CatalogRef.ОснованияДосрочногоНазначенияПенсии</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияТрудаПФР</name>
    <type>
      <types>CatalogRef.ОсобыеУсловияТрудаПФР</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПозицииСпискаПФР</name>
    <type>
      <types>CatalogRef.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыплачиваетсяНадбавкаЗаВредность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентНадбавкиЗаВредность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФОТУправленческий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФОТУправленческийМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФОТУправленческийМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПозицийПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерВыполняемыхРаботПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервичныеДокументыПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудоваяФункция</name>
    <type>
      <types>CatalogRef.ТрудовыеФункции</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаСКоронавирусом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВредныеФакторыСопоставлены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтажаЛетныхЭкипажей</name>
    <type>
      <types>EnumRef.ВидыСтажаЛетныхЭкипажей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтажаШахтеров</name>
    <type>
      <types>EnumRef.ВидыСтажаШахтеров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиВидаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерМин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерМакс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>ИдентификаторСтрокиВидаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеМин</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеМакс</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЕжегодныеОтпуска</name>
    <attributes>
      <name>ВидЕжегодногоОтпуска</name>
      <type>
        <types>CatalogRef.ВидыОтпусков</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейВГод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Специальности</name>
    <attributes>
      <name>Специальность</name>
      <type>
        <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УправленческиеНачисления</name>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиВидаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерМин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерМакс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УправленческиеПоказатели</name>
    <attributes>
      <name>ИдентификаторСтрокиВидаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеМин</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеМакс</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗависимыеСтажи</name>
    <attributes>
      <name>ВидСтажа</name>
      <type>
        <types>CatalogRef.ВидыСтажа</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ИнтеграцияУправлениеПерсоналом/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
	
#Область ПравилаПубликации

Процедура ЗаполнитьДеревоНастроекПубликации(Параметры, АдресХранилища) Экспорт

	Приложение = Параметры.Приложение;
	
	Результат = Новый Структура("РезультатЗапроса,ИспользоватьШтатноеРасписание,ДанныеДоступны");
	
	ИспользоватьШтатноеРасписание = Ложь;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	УстановитьПривилегированныйРежим(Истина);
	ИнтеграцияУправлениеПерсоналом.СоздатьВТШтатноеРасписание(МенеджерВТ, ИспользоватьШтатноеРасписание);
	УстановитьПривилегированныйРежим(Ложь);
	
	Результат.ИспользоватьШтатноеРасписание = ИспользоватьШтатноеРасписание;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Приложение", Приложение);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтатноеРасписание.Организация КАК Организация,
	|	ШтатноеРасписание.Подразделение КАК Подразделение,
	|	ШтатноеРасписание.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
	|	ШтатноеРасписание.Должность КАК Должность,
	|	НЕ ШтатноеРасписание.Утверждена КАК НеУтверждена,
	|	ШтатноеРасписание.ДатаУтверждения КАК ДатаУтверждения,
	|	ШтатноеРасписание.Закрыта КАК Закрыта,
	|	ШтатноеРасписание.ДатаЗакрытия КАК ДатаЗакрытия,
	|	ШтатноеРасписание.Подразделение.РеквизитДопУпорядочиванияИерархического КАК ПорядокПодразделений,
	|	ШтатноеРасписание.Должность.РеквизитДопУпорядочивания КАК ПорядокДолжностей,
	|	ВЫБОР
	|		КОГДА ПравилаВыгрузки.Ссылка ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Выгружать
	|ИЗ
	|	ВТШтатноеРасписание КАК ШтатноеРасписание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаВыгрузкиУправлениеПерсоналом КАК ПравилаВыгрузки
	|		ПО ШтатноеРасписание.ПозицияШтатногоРасписания = ПравилаВыгрузки.Ссылка
	|			И (ПравилаВыгрузки.Ссылка ССЫЛКА Справочник.ШтатноеРасписание)
	|			И (ПравилаВыгрузки.Приложение = &Приложение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ШтатноеРасписание.Организация.Наименование,
	|	ШтатноеРасписание.Подразделение.РеквизитДопУпорядочиванияИерархического,
	|	ШтатноеРасписание.Должность.РеквизитДопУпорядочивания
	|ИТОГИ ПО
	|	Организация,
	|	Подразделение ИЕРАРХИЯ";
	Если Не ИспользоватьШтатноеРасписание Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НЕ ШтатноеРасписание.Утверждена", "ЛОЖЬ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ШтатноеРасписание.ДатаУтверждения", """");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ШтатноеРасписание.Закрыта", "ЛОЖЬ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ШтатноеРасписание.ДатаЗакрытия", """");
	КонецЕсли;
	
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
		Результат.ДанныеДоступны = Истина;
		Результат.РезультатЗапроса = РезультатЗапроса;
	Исключение
		СообщениеОбОшибке = НСтр("ru = 'Настройка правил. Пользователю недоступны организации и/или позиции штатного расписания.';
								|en = 'Rule settings. Companies or headcount positions are not available to a user.'");
		Результат.ДанныеДоступны = Ложь;
	КонецПопытки;
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);

КонецПроцедуры

Процедура СохранитьПравилаВыгрузки(Параметры, АдресХранилища) Экспорт
	
	Приложение = Параметры.Приложение;
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ИнтеграцияУправлениеПерсоналом.СохранитьНовыеПравилаВыгрузки(Приложение, Параметры.НовыеНастройки);
	Исключение
		ШаблонОписания = НСтр("ru = 'Ошибка при записи правил приложения %1
		|%2';
		|en = 'An error occurred when saving the application rules %1
		|%2'");
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Комментарий = СтрШаблон(ШаблонОписания, Строка(Приложение), ПодробноеПредставлениеОшибки);
		ИмяСобытия = ИнтеграцияУправлениеПерсоналом.ИменаСобытийЖР(Приложение).ПрочиеСобытия;
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
		// Текст ошибки обрабатывается при завершении фонового задания.
		ВызватьИсключение ОбработкаОшибок.ПредставлениеОшибкиДляПользователя(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
